Repository: i33ym/fitora
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru, uz, uz_cyrl

source: This code is already in use
ru: Этот код уже используется
uz: Bu kod allaqachon ishlatilmoqda
uz_cyrl: Бу код аллақачон ишлатилмоқда

source: Invalid credentials
ru: Неверные учетные данные
uz: Kirish ma'lumotlari noto'g'ri
uz_cyrl: Кириш маълумотлари нотўғри

source: Code already in use
ru: Код уже используется
uz: Kod allaqachon ishlatilmoqda
uz_cyrl: Код аллақачон ишлатилмоқда

source: Request approved
ru: Запрос одобрен
uz: So'rov tasdiqlandi
uz_cyrl: Сўров тасдиқланди

source: Request rejected
ru: Запрос отклонен
uz: So'rov rad etildi
uz_cyrl: Сўров рад этилди

source: Invalid group code
ru: Неверный код группы
uz: Noto'g'ri guruh kodi
uz_cyrl: Нотўғри гурух коди

source: You already have an approved dietologist
ru: У вас уже есть утвержденный диетолог
uz: Sizda allaqachon tasdiqlangan dietolog bor
uz_cyrl: Сизда аллақачон тасдиқланган диетолог бор

source: Request already pending
ru: Запрос уже ожидает рассмотрения
uz: So'rov allaqachon kutilmoqda
uz_cyrl: Сўров аллақачон кутилмоқда

source: Request sent successfully
ru: Запрос успешно отправлен
uz: So'rov muvaffaqiyatli yuborildi
uz_cyrl: Сўров муваффақиятли юборилди

source: English
ru: Английский
uz: Inglizcha
uz_cyrl: Инглизча

source: Uzbek (Latin)
ru: Узбекский (Латиница)
uz: O'zbekcha (Lotin)
uz_cyrl: Ўзбекча (Лотин)

source: Uzbek (Cyrillic)
ru: Узбекский (Кириллица)
uz: O'zbekcha (Kirill)
uz_cyrl: Ўзбекча (Кирилл)

source: Russian
ru: Русский
uz: Ruscha
uz_cyrl: Русча

source: foods_data must contain a 'foods' array
ru: foods_data должен содержать массив 'foods'
uz: foods_data 'foods' massivini o'z ichiga olishi kerak
uz_cyrl: foods_data 'foods' массивини ўз ичига олиши керак

source: 'foods' must be an array
ru: 'foods' должен быть массивом
uz: 'foods' massiv bo'lishi kerak
uz_cyrl: 'foods' массив бўлиши керак

source: Analysis failed
ru: Анализ не удался
uz: Tahlil muvaffaqiyatsiz tugadi
uz_cyrl: Таҳлил муваффақиятсиз тугади

source: Date parameter is required
ru: Параметр даты обязателен
uz: Sana parametri talab qilinadi
uz_cyrl: Сана параметри талаб қилинади

source: Invalid date format. Use YYYY-MM-DD
ru: Неверный формат даты. Используйте YYYY-MM-DD
uz: Noto'g'ri sana formati. YYYY-MM-DD formatidan foydalaning
uz_cyrl: Нотўғри сана формати. YYYY-MM-DD форматидан фойдаланинг

source: User must be at least 13 years old.
ru: Пользователь должен быть не моложе 13 лет.
uz: Foydalanuvchi kamida 13 yoshda bo'lishi kerak.
uz_cyrl: Фойдаланувчи камида 13 ёшда бўлиши керак.

source: Target date must be in the future.
ru: Целевая дата должна быть в будущем.
uz: Maqsad sanasi kelajakda bo'lishi kerak.
uz_cyrl: Мақсад санаси келажакда бўлиши керак.

source: Weight values must be positive.
ru: Значения веса должны быть положительными.
uz: Vazn qiymatlari musbat bo'lishi kerak.
uz_cyrl: Вазн қийматлари мусбат бўлиши керак.

source: Height must be positive.
ru: Рост должен быть положительным.
uz: Bo'y musbat bo'lishi kerak.
uz_cyrl: Бўй мусбат бўлиши керак.

source: Failed to send OTP
ru: Не удалось отправить код подтверждения
uz: Tasdiqlash kodini yuborib bo'lmadi
uz_cyrl: Тасдиқлаш кодини юбориб бўлмади

source: OTP sent successfully
ru: Код подтверждения успешно отправлен
uz: Tasdiqlash kodi muvaffaqiyatli yuborildi
uz_cyrl: Тасдиқлаш коди муваффақиятли юборилди

source: Invalid session
ru: Недействительная сессия
uz: Yaroqsiz sessiya
uz_cyrl: Яроқсиз сессия

source: OTP expired
ru: Срок действия кода истек
uz: Tasdiqlash kodi muddati tugagan
uz_cyrl: Тасдиқлаш коди муддати тугаган

source: Invalid OTP
ru: Неверный код подтверждения
uz: Noto'g'ri tasdiqlash kodi
uz_cyrl: Нотўғри тасдиқлаш коди

source: Invalid Google token
ru: Недействительный Google токен
uz: Noto'g'ri Google token
uz_cyrl: Нотўғри Google token

source: Profile already completed
ru: Профиль уже заполнен
uz: Profil allaqachon to'ldirilgan
uz_cyrl: Профил аллақачон тўлдирилган
